In [53]:
import numpy as np
import pandas as pd

# DataFrame Basic Operation

In [54]:
df1 = pd.DataFrame({
    "A": [2, 4, 6, 8, 10],
    "B": [5, 10, 15, 20, 25],
    "C": [100, 200, 300, 400, 500]
})

df1

    A   B    C
0   2   5  100
1   4  10  200
2   6  15  300
3   8  20  400
4  10  25  500

In [55]:
df1.shape

(5, 3)

In [56]:
df1.columns

Index(['A', 'B', 'C'], dtype='object')

In [57]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       5 non-null      int64
 2   C       5 non-null      int64
dtypes: int64(3)
memory usage: 252.0 bytes

In [58]:
df1.describe()

               A          B           C
count   5.000000   5.000000    5.000000
mean    6.000000  15.000000  300.000000
std     3.162278   7.905694  158.113883
min     2.000000   5.000000  100.000000
25%     4.000000  10.000000  200.000000
50%     6.000000  15.000000  300.000000
75%     8.000000  20.000000  400.000000
max    10.000000  25.000000  500.000000

In [59]:
# You also do brodcasting in DataFrame
df1 + 2

    A   B    C
0   4   7  102
1   6  12  202
2   8  17  302
3  10  22  402
4  12  27  502

# DataFrame Applying Function

In [61]:
def square(x):
    return x ** 3
df1.apply(square)

      A      B          C
0     8    125    1000000
1    64   1000    8000000
2   216   3375   27000000
3   512   8000   64000000
4  1000  15625  125000000

In [63]:
# Now Adding new col using this all stuff
def square(x):
    return x ** 3
df1["D"] = df1["B"].apply(square)

In [64]:
df1

    A   B    C      D
0   2   5  100    125
1   4  10  200   1000
2   6  15  300   3375
3   8  20  400   8000
4  10  25  500  15625